In [ ]:
import pandas as pd

In [ ]:
visitors = pd.read_csv("visitors.csv")

In [20]:
visitors.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard

In [21]:
visitors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  datetime64[ns]
 3   appt_end_date      47954 non-null  datetime64[ns]
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: datetime64[ns](2), object(6)
memory usage: 2.9+ MB

In [22]:
visitors["appt_start_date"] = pd.to_datetime(visitors["appt_start_date"])

In [23]:
visitors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  datetime64[ns]
 3   appt_end_date      47954 non-null  datetime64[ns]
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: datetime64[ns](2), object(6)
memory usage: 2.9+ MB

In [24]:
date_sample = "1/6/15 9:30"
date_formate = "%m/%d/%y %H:%M"

In [25]:
visitors["appt_start_date"] = pd.to_datetime(visitors["appt_start_date"], format = date_formate)

In [26]:
visitors["appt_end_date"] = pd.to_datetime(visitors["appt_end_date"], format = date_formate)

In [27]:
visitors.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,2015-01-06 09:30:00,2015-01-06 23:59:00,NaN,potus,west wing,JointService Military Honor Guard

In [28]:
visitors["appt_start_date"].dt.strftime("%A,%B")

0        Tuesday,January
1        Tuesday,January
2        Tuesday,January
3        Tuesday,January
4        Tuesday,January
              ...
47949    Friday,December
47950    Friday,December
47951    Friday,December
47952    Friday,December
47953    Friday,December
Name: appt_start_date, Length: 47954, dtype: object

In [29]:
month_wise_data = visitors["appt_start_date"].dt.strftime("%B %y")

In [30]:
month_wise_data.value_counts()

December 15     13029
June 15          7743
April 15         4996
September 15     4416
October 15       3669
May 15           3013
July 15          2930
March 15         2262
February 15      2165
August 15        1350
January 15       1248
November 15      1133
Name: appt_start_date, dtype: int64

In [31]:
length = visitors["appt_end_date"]-visitors["appt_start_date"]

In [32]:
length

0       0 days 14:29:00
1       0 days 14:29:00
2       0 days 14:29:00
3       0 days 14:29:00
4       0 days 14:29:00
              ...
47949   0 days 07:29:00
47950   0 days 07:29:00
47951   0 days 07:29:00
47952   0 days 07:29:00
47953   0 days 07:29:00
Length: 47954, dtype: timedelta64[ns]

In [33]:
length.max()

Timedelta('16 days 12:59:00')

In [34]:
length.min()

Timedelta('0 days 02:29:00')

In [36]:
visitors.to_csv("date_time_clean_visitors.csv")